

<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
    <title></title>
    <link rel="stylesheet" type="text/css" href="ss.css">
</head>

  <div id="basil">write a code by basilshraim</div>
<body >

<div id="led" >
    <h1 style="text-align: center;color: red;">  تعليمات</h1>

   

<div style="margin-top: 200px;">


 







	<h2 style="float: right;background-color: #ecb390;">التعليمات</h2><br><hr><br>


<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
 
<br>

يوجد ثلاث انواع من الحسابات
المستخدمين :



<h3>:الالية</h3>
<li>يقوم الشخص بالتسجيل في الموقع </li>
<li>يقوم الشخص بشحن مبلغ من المال في حسابه في الموقع</li>
 <li>يقوم الشخص بتصفح البرنامج واختيار المحل
 </li>
<li>يمكن للمستخدم ان يشتري من الموقع بطريقتين</li>
 
</ol>


<br><br>


<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
 
<br>




<h3>: الشراء من الموقع</h3>
<li>الشراء (بدون خدمة توصيل): حيث يقوم المستخدم بالدخول الى صفحة المحل الذي يريده ويقوم بالشراء ، ويتم تحديد موعد استلام البضاعة ومن ثم يذهب المستخدم لاستلام البضاعة فقط دون دفع أي مبلغ للمحل
 </li>
<li>الشراء (مع خدمة توصيل) : حيث يقوم المستخدم المستخدم بالدخول الى صفحة المحل الذي يريده ويقوم بالشراء ، ومن ثم يقوم الموقع بارسال تكسي لاخذ البضاعة من المحل وتوصيلها الى المستخدم
  </li>
 
</ol>

<br><br>

<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
موقع لمسة : هو موقع الكتروني يقوم بربط محلات مدينة قلقيلية بالموقع ، ومن ثم يقوم كل محل بعرض بضاعته على الموقع والسماح للمستخدمين بالتصفح و شراء البضائع من الموقع وامكانية تسليمها للمستخدمين حسب رغبة المستخدم


<br>




<h3>الالية(للحساب الشخصي):</h3>
<li>عند التسجيل في الموقع يمتلك كل مستخدم حساب له في الموقع  </li>
<li>تم تقسيم مدينة قلقيلية الى عدة مناطق لتسهيل عملية توصيل الطلبات   </li>
<li>يقوم كل مستخدم بالتسجيل في المنطقة التي تتضمن الحي او الشارع الذي يسكن فيه  </li>
<li>يقوم المستخدم بشحن مبلغ من المال في حسابه عن طريق نقاط الشحن الموجودة في كل المناطق او عن طريق تقديم طلب شحن رصيد </li>من الموقع نفسه </li>
<li>يقوم المستخدم باستكشاف المحلات المتواجدة ضمن منطقته </li>
<li>يقوم المستخدم بشراء ما يحتاج من البضاعة ، بحيث تتواجد عملية الشراء التي يقوم بها المستخدم في سلة المشتريات  </li>
<li>يتم توصيل طلبات المستخدمين يومين من كل اسبوع (يوم التسليم) </li>
<li>عند تنفيذ أي عملية شراء يقوم الموقع تلقائيا بخصم قيمة الشراء وارسالها الى حساب صاحب المحل  </li>
</ol>


<br><br>





<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
<li>الشراء بدون خدمة توصيل: يقوم المستخدم بتصفح المحلات وشراء احتياجاته ، ثم يذهب للمحل ويستلم طلبه دون انتظار و بدون دفع المال لصاحب المحل (يتم خصم المبلغ من حساب الشخص في الموقع)
</li>
<li>الشراء مع خدمة توصيل : : يقوم المستخدم بتصفح المحلات وشراء احتياجاته ، ويتم ارسال الطلب بواسطة سيارة(تكسي) للمستخدم دون دفع المال(يتم خصم المبلغ من حساب الشخص في الموقع)

</li>
</ol>
<br><br>
<br>
<h2 style="float: right;">:الالية للحساب التجاري(اصحاب المحلات)</h2><br><hr><br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
يضم هذا الحساب كل اصحاب المحلات التجارية فقط

<li>الشراء (بدون خدمة توصيل): يقوم صاحب المحل باستقبال طلب الزبون وتجهيز الطلب وتسليمه للزبون عند وصوله
</li>
<li>
الشراء (مع خدمة توصيل): يقوم صاحب المحل باستقبال طلب الزبون وتجهيز الطلب وتسليمه لتكسي تم ارساله من الموقع 
 </li>
 </ol>
<br><br>

<h2 style="float: right;">:مكتب تكسي</h2><br><hr><br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">
 

<li>يضم هذا الحساب مكاتب التكاسي فقط
الالية :عند طلب المستخدم (الشراء مع خدمة توصيل) يتم ارسال طلب الى حساب مكتب التكسي ،ومن ثم يقوم المكتب بالرد على الطلب بالقبول او الرفض خلال 5 دقائق ، في حالة القبول يتم تحديد موعد من قبل المكتب بارسال سيارة(تكسي) لاخذ الطلب بحيث لا تتجاوز مدة استلام الطلب من المحل 30 دقيقة و مدة توصيل الطلب للمستخدم 15 دقيقة (30+15=45 دقيقة) 
في حالة تاخر مكتب التكسي الرد على الطلب يتم ارسال الطلب الى مكتب اخر

</li>
 
 </ol>

<br><br>
<br>
<h2 style="float: right;background-color: #ecb390;">عملية الشحن</h2><br><hr>
<br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<li> يقوم المستخدم بشحن رصيده من خلال نقاط الشحن المتوزعة في كافة انحاء المدينة
  </li>
<br> 
<br>
</ol><br><br>
<h2 style="float: right;background-color: #ecb390;"> المخالفات والعقوبات</h2><br><hr>
<br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<h3>لعقوبات  للمستخدمين: </h3>
<li>انذار اول  </li>  
<li>انذار ثاني  </li>
<li>حرمان من استخدام الموقع ليوم واحد</li>
<li>حرمان من استخدام الموقع ليومين</li>
<li>حرمان من استخدام الموقع لمدة اسبوع </li>
 <li>حرمان من استخدام الموقع لمدة شهر </li>
<li>حذف الحساب   </li>
</ol>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<h3>لاصحاب المحلات   </h3>
<li>انذار اول   </li>
<li>انذار ثاني  </li>
<li>انذار ثالث  </li>
<li>حرمان من استخدام الموقع ليوم واحد
  </li>
<li>حرمان من استخدام الموقع ليومين
 </li>
<li>حرمان من استخدام الموقع لمدة اسبوع
  </li>

<li>حذف الحساب  </li>
</ol>
<br><br>
</div>

</div>
</body>
</html>