

<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8">
    <title></title>
    <link rel="stylesheet" type="text/css" href="ss.css">
</head>

  <div id="basil">write a code by basilshraim</div>
<body >

<div id="led" >
    <h1 style="text-align: center;color: red;">  تعليمات</h1>

   

<div style="margin-top: 200px;">
	<h2 style="float: right;background-color: #ecb390;">التعليمات</h2><br><hr><br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

موقع لمسة : هو موقع الكتروني يقوم بتقسيم مدينة قلقيلية الى 20 منطقة وربط كل المحلات بالموقع ، كل حسب منطقته ، ومن ثم يقوم كل محل بعرض بضاعته على الموقع والسماح للمستخدمين بشراء البضائع من الموقع وتسليمها للمستخدمين بواسطة
مجموعة من الاشخاص الذين يقومون بتوصيل احتياجات الاشخاص الى منازلهم دون الحاجة الى خروجهم الى المحلات او الاسواق او اماكن التجمعات



<br>




<h3>الالية(للحساب الشخصي):</h3>
<li>عند التسجيل في الموقع يمتلك كل مستخدم حساب له في الموقع  </li>
<li>تم تقسيم مدينة قلقيلية الى عدة مناطق لتسهيل عملية توصيل الطلبات   </li>
<li>يقوم كل مستخدم بالتسجيل في المنطقة التي تتضمن الحي او الشارع الذي يسكن فيه  </li>
<li>يقوم المستخدم بشحن مبلغ من المال في حسابه عن طريق نقاط الشحن الموجودة في كل المناطق او عن طريق تقديم طلب شحن رصيد </li>من الموقع نفسه </li>
<li>يقوم المستخدم باستكشاف المحلات المتواجدة ضمن منطقته </li>
<li>يقوم المستخدم بشراء ما يحتاج من البضاعة ، بحيث تتواجد عملية الشراء التي يقوم بها المستخدم في سلة المشتريات  </li>
<li>يتم توصيل طلبات المستخدمين يومين من كل اسبوع (يوم التسليم) </li>
<li>عند تنفيذ أي عملية شراء يقوم الموقع تلقائيا بخصم قيمة الشراء وارسالها الى حساب صاحب المحل  </li>
</ol>
<br>
<h2 style="float: right;">:الالية للحساب التجاري(اصحاب المحلات)</h2><br><hr><br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<li>يقوم صاحب المحل باستلام طلبات المستخدمين بحيث يتم تخزين عمليات الشراء في سلة المبيعات/الطلبات  </li>
<li>
تتوقف عملية تخزين عمليات الشراء في اليوم الاخير الذي ياتي قبل يوم التسليم عند الساعة 2 ظهرا  </li>
<li>
بعد ذلك يقوم الموقع بتخزين عمليات الشراء ليوم التسليم القادم  </li>
<li>
يقوم صاحب المحل بتجميع طلبات المستخدمين وتجهيزها لتسليمها لموظفي البرنامج (دورية) في اليوم التالي (يوم التسليم) </li>
<li>
في يوم التسليم يقوم الموظفون(الدورية) بمحاسبة صاحب المحل عن كافة طلبات المستخدمين الذين قامو بالشراء من محله </li>
<li>تقوم الدورية باستلام الطلبيات من المحلات وتوزيعها على المستخدمين في المنطقة  </li>
</ol>
<br>
<h2 style="float: right;background-color: #ecb390;">عملية الشحن</h2><br><hr>
<br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<li> يقوم المستخدم بشحن رصيده (اول عملية شحن) من خلال نقاط الشحن المتوزعة على كافة المناطق  </li>
<br>
<li> يقوم المستخدم بشحن رصيده في المرات الاخرى عن طريق تقديم طلب شحن من الموقع نفسه  ، بحيث يتم ارسال موظف للمستخدم في موعد يتم تحديده للمستخدم مسبقا حيث يقوم المستخدم بدفع مبلغ الشحن واستلام وصل من الموظف وبعدة عدة دقائق يتم تحويل المبلغ الى حساب المستخدم داخل الموقع  </li>
<br>
<li> يقوم المستخدم بشحن رصيده في المرات الاخرى  من خلال نقاط الشحن المتوزعة على كافة المناطق  </li>
<br>
</ol><br>
<h2 style="float: right;background-color: #ecb390;"> المخالفات والعقوبات</h2><br><hr>
<br>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<h3>لعقوبات  للمستخدمين: </h3>
<li>انذار اول  </li>    <li>انذار ثاني  </li>
<li>حرمان ليوم تسليم واحد</li>
<li>حرمان ليومي  تسليم (اسبوع)</li>
<li>حرمان لمدة اسبوعين   </li>
<li>حرمان لمدة شهر </li>
<li>حذف الحساب   </li>
</ol>
<ol type="1" style="list-style: arabic-indic;display: list-item;direction: rtl;list-style-position: inside;">

<h3>لاصحاب المحلات   </h3>
<li>انذار اول   </li>
<li>انذار ثاني  </li>
<li>انذار ثالث  </li>
<li>حرمان ليوم تسليم  </li>
<li>حرمان ليومي تسليم(اسبوع) </li>
<li>حرمان لمدة اسبوعين  </li>
<li>حرمان لمدة شهر </li>
<li>حذف الحساب  </li>
</ol>

</div>

</div>
</body>
</html>